# Taps
tap "homebrew/bundle"
tap "symfony-cli/tap"
tap "mutagen-io/mutagen"
tap "getsentry/tools"

# -------------------------------------------------------------------
# CLI Tools
# -------------------------------------------------------------------
brew "awscli"
brew "biome"
brew "commitizen"
brew "eza"
brew "glab"              # GitLab CLI (replaces gh)
brew "git"
brew "git-lfs"
brew "k6"
brew "luajit"
brew "mutagen-io/mutagen/mutagen"
brew "neovim"
brew "node"
brew "nvm"
brew "php"               # PHP 8.x
brew "phrase-cli"        # Phrase translation CLI
brew "pipx"
brew "python@3.13"
brew "ripgrep"
brew "sentry-cli"        # Sentry CLI
brew "starship"
brew "symfony-cli"       # Symfony CLI
brew "tmux"
brew "tree-sitter"
brew "watchman"
brew "zsh-syntax-highlighting"


# -------------------------------------------------------------------
# Fonts (Nerd Fonts)
# -------------------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"

# -------------------------------------------------------------------
# GUI Applications - Dev Tools
# -------------------------------------------------------------------
cask "betterdisplay"
cask "cursor"
cask "docker"
cask "figma"
cask "ghostty"
cask "imageoptim"
cask "raycast"
cask "visual-studio-code"
cask "zed"

# -------------------------------------------------------------------
# GUI Applications - Work / Communication
# -------------------------------------------------------------------
cask "google-chrome"
cask "slab"
cask "slack"
# -------------------------------------------------------------------
# Mac App Store (install mas-cli first: brew install mas)
# Uncomment and add app IDs if you use MAS apps
# -------------------------------------------------------------------
# brew "mas"
# mas "Xcode", id: 497799835
